#+TITLE: Guangfu Shi's Emacs Configuration
#+OPTIONS: toc:4 h:4

** Personal information

#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Guangfu Shi"
        user-mail-address "stevegocoding@gmail.com")
#+END_SRC

#+RESULTS:
: stevegocoding@gmail.com


*** Backups

This is one of the things people usually want to change right away. By default, Emacs saves backup files in the current directory. These are the files ending in =~= that are cluttering up your directory lists. The following code stashes them all in =~/.emacs.d/backups=, where I can find them with =C-x C-f= (=find-file=) if I really need to.

#+BEGIN_SRC emacs-lisp
(setq delete-old-versions -1)
(setq version-control t)
(setq vc-make-backup-files t)
(setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))
#+END_SRC

#+RESULTS:
| .* | ~/.emacs.d/auto-save-list/ | t |

*** History

From http://www.wisdomandwonder.com/wordpress/wp-content/uploads/2014/03/C3F.html
#+BEGIN_SRC emacs-lisp
(setq savehist-file "~/.emacs.d/savehist")
(savehist-mode 1)
(setq history-length t)
(setq history-delete-duplicates t)
(setq savehist-save-minibuffer-history 1)
(setq savehist-additional-variables
      '(kill-ring
        search-ring
        regexp-search-ring))
#+END_SRC

#+RESULTS:
| kill-ring | search-ring | regexp-search-ring |

*** Windows configuration

#+BEGIN_SRC emacs-lisp
(when window-system
  (tooltip-mode -1)
  (tool-bar-mode -1)
  (menu-bar-mode 1)
  (scroll-bar-mode -1))

(setq ring-bell-function (lambda () (message "*beep*")))
#+END_SRC

#+RESULTS:
| lambda | nil | (message *beep*) |

*** Mode line format

Display a more compact mode line
#+BEGIN_SRC emacs-lisp
  (use-package smart-mode-line
    :init
    (add-hook 'after-init-hook 'sml/setup)
    :config
    (progn
      (setq sml/no-confirm-load-theme t)
      
      (sml/apply-theme 'light)
      (setq sml/name-width 20)
      (setq sml/mode-width 'full)
      (setq sml/shorten-directory t)
      (setq sml/shorten-modes t)
      
      ;; Display time
      (setq display-time-24hr-format t)
      (display-time-mode 1)

      ;; Format
      (setq-default mode-line-format
                    '("%e"
                      mode-line-front-space
                      mode-line-mule-info
                      mode-line-client
                      mode-line-modified
                      mode-line-remote
                      mode-line-frame-identification
                      mode-line-buffer-identification
                      "   "
                      mode-line-position
                      (vc-mode vc-mode)
                      "  "
                      mode-line-modes
                      mode-line-misc-info
                      mode-line-end-spaces))))

#+END_SRC

#+RESULTS:
| %e | mode-line-front-space | mode-line-mule-info | mode-line-client | mode-line-modified | mode-line-remote | mode-line-frame-identification | mode-line-buffer-identification |   | mode-line-position | (vc-mode vc-mode) |   | mode-line-modes | mode-line-misc-info | mode-line-end-spaces |

*** UTF-8

From http://www.wisdomandwonder.com/wordpress/wp-content/uploads/2014/03/C3F.html
#+BEGIN_SRC emacs-lisp
(prefer-coding-system 'utf-8)
(when (display-graphic-p)
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
#+END_SRC

#+RESULTS:
| UTF8_STRING | COMPOUND_TEXT | TEXT | STRING |

*** Frequently-accessed files

#+BEGIN_SRC emacs-lisp
(defvar my/refile-map (make-sparse-keymap))

(defmacro my/defshortcut (key file)
  `(progn
     (set-register ,key (cons 'file ,file))
     (define-key my/refile-map
       (char-to-string ,key)
       (lambda (prefix)
         (interactive "p")
         (let ((org-refile-targets '(((,file) :maxlevel . 6)))
               (current-prefix-arg (or current-prefix-arg '(4))))
           (call-interactively 'org-refile))))))

(my/defshortcut ?i "~/.emacs.d/magkbdev.org")
(my/defshortcut ?o "~/develop/projects/notes/organizer.org")
(my/defshortcut ?1 "~/develop/projects/notes/oracle_1z0-061_prep.org")
#+END_SRC

#+RESULTS:
| lambda | (prefix) | (interactive p) | (let ((org-refile-targets (quote (((~/develop/projects/notes/oracle_1z0-061_prep.org) :maxlevel . 6)))) (current-prefix-arg (or current-prefix-arg (quote (4))))) (call-interactively (quote org-refile))) |

**

*** Movement
#+BEGIN_SRC emacs-lisp
(bind-keys ("C-S-n" . (lambda () (interactive) (ignore-errors (next-line 5))))
           ("C-S-p" . (lambda () (interactive) (ignore-errors (previous-line 5))))
           ("C-S-b" . (lambda () (interactive) (ignore-errors (backward-char 5))))
           ("C-S-f" . (lambda () (interactive) (ignore-errors (forward-char 5)))))
#+END_SRC

#+RESULTS:
| lambda | nil | (interactive) | (ignore-errors (forward-char 5)) |

*** Scroll 
#+BEGIN_SRC emacs-lisp

(setq
  scroll-margin 0                  
  scroll-conservatively 100000
  scroll-preserve-screen-position 1)

#+END_SRC

#+RESULTS:
: 1

*** Windmove - switching between windows

Windmove lets you move between windows with something more natural than cycling through =C-x o= (=other-window=).
Windmove doesn't behave well with Org, so we need to use different keybindings.

#+BEGIN_SRC emacs-lisp
(use-package windmove
  :defer t
   )
(windmove-default-keybindings)
(add-hook 'org-shiftup-final-hook 'windmove-up)
(add-hook 'org-shiftleft-final-hook 'windmove-left)
(add-hook 'org-shiftdown-final-hook 'windmove-down)
(add-hook 'org-shiftright-final-hook 'windmove-right)
#+END_SRC

#+RESULTS:
| windmove-right |

*** Frequently-accessed files
Registers allow you to jump to a file or other location quickly. To
jump to a register, use =C-x r j= followed by the letter of the
register. Using registers for all these file shortcuts is probably a bit of a waste since I can easily define my own keymap, but since I rarely go beyond register A anyway. Also, I might as well add shortcuts for refiling.

#+BEGIN_SRC emacs-lisp
(defvar my/refile-map (make-sparse-keymap))

(defmacro my/defshortcut (key file)
  `(progn
     (set-register ,key (cons 'file ,file))
     (define-key my/refile-map
       (char-to-string ,key)
       (lambda (prefix)
         (interactive "p")
         (let ((org-refile-targets '(((,file) :maxlevel . 6)))
               (current-prefix-arg (or current-prefix-arg '(4))))
           (call-interactively 'org-refile))))))

(my/defshortcut ?c "~/.emacs.d/magkbdev.org")
#+END_SRC

#+RESULTS:
| lambda | (prefix) | (interactive p) | (let ((org-refile-targets (quote (((~/.emacs.d/magkbdev.org) :maxlevel . 6)))) (current-prefix-arg (or current-prefix-arg (quote (4))))) (call-interactively (quote org-refile))) |


*** Tab width of 2 is compact and readable
#+BEGIN_SRC emacs-lisp
(setq-default tab-width 2)
#+END_SRC

#+RESULTS:
: 2

